OpenNuvoton/M480BSP/Library/UsbHostLib/src_core/ehci.c
        /*
         *  Port reset success. Start to enumerate this new device.
         */
        udev = alloc_device();
        if (udev == NULL)
            return 0;                       /* out-of-memory, do nothing...               */

        udev->parent = NULL;
        udev->port_num = 1;
        udev->speed = SPEED_HIGH;
        udev->hc_driver = &ehci_driver;

        ret = connect_device(udev);
        if (ret < 0) {
            USB_error("connect_device error! [%d]\n", ret);
            free_device(udev);
        }
    } else {
        /*
         *  Device disconnected
         */
        while (1) {
            udev = ehci_find_device_by_port(1);
            if (udev == NULL)
                break;
            disconnect_device(udev);
        }
        change = 1;
    }
    return change;
}


HC_DRV_T  ehci_driver = {
    ehci_init,               /* init               */
    ehci_shutdown,           /* shutdown           */
    ehci_suspend,            /* suspend            */
    ehci_resume,             /* resume             */
    ehci_ctrl_xfer,          /* ctrl_xfer          */
    ehci_bulk_xfer,          /* bulk_xfer          */
    ehci_int_xfer,           /* int_xfer           */
    ehci_iso_xfer,           /* iso_xfer           */
    ehci_quit_xfer,          /* quit_xfer          */
    ehci_rh_port_reset,      /* rthub_port_reset   */
    ehci_rh_polling          /* rthub_polling      */
};


/// @endcond HIDDEN_SYMBOLS

/*** (C) COPYRIGHT 2017 Nuvoton Technology Corp. ***/
